import pandas as pd 

fio = input('Введите ФИО: ')
adress = input('Введите адрес: ')
phone = input('Введите номер телефона: ')
bd = input('Введите дату рождения: ')
df = pd.DataFrame({
    'ФИО': [fio],
    'Адрес': [adress],
    'Телефон': [phone],
    'Дата рождения': [bd]
})
print(df)
print('-----------------------------------------------------------------------')
i = 67
while i !='4':
    i = input('Хотите ли вы ещё что-то добавить (1), удалить (2), изменить (3), оставить неизменной (4): ')
    if i == '1':
        fio1 = input('Введите ФИО: ')
        adress1 = input('Введите адрес: ')
        phone1 = input('Введите номер телефона: ')
        bd1 = input('Введите дату рождения: ')
        df.loc[len(df)] = [fio1, adress1, phone1, bd1]
        print(df)
        print('-----------------------------------------------------------------------')
    elif i == '2':
        n = int(input('Введите индекс строки, которую хотите удалить: '))
        df = df.drop([n])
        print(df)
        print('-----------------------------------------------------------------------')
    elif i == '3':
        n1 = int(input('Введите индекс строки, которую хотите изменить: '))
        fio2 = input('Введите ФИО: ')
        adress2 = input('Введите адрес: ')
        phone2 = input('Введите номер телефона: ')
        bd2 = input('Введите дату рождения: ')
        df.loc[n1] = [fio2, adress2, phone2, bd2]
        print(df)
        print('-----------------------------------------------------------------------')
    elif i == '4':
        print(df)
        print('-----------------------------------------------------------------------')

    else:
        print('Некорректный ввод(должно быть от 1 до 4), попробуйте ещё раз: ')
