import pandas as pd 

fio = input('Введите ФИО: ') #Ввод изначальных данных для адресной книги
adres = input('Введите адрес: ')
phone = input('Введите номер телефона: ')
bd = input('Введите дату рождения: ')
df = pd.DataFrame({
    'ФИО': [fio],
    'Адрес': [adres],
    'Телефон': [phone],
    'Дата рождения': [bd]
}) #Создали нашу адресную книгу (датафрейм)
print(df)
print('-----------------------------------------------------------------------')
i = 67 #Создали переменную (произвольное значение) чтобы начался цикл
while i !='4': #Пользователь больше не будет как-либо менять адресную книгу
    i = input('Хотите ли вы ещё что-то добавить (1), удалить (2), изменить (3), оставить неизменной (4): ')
    if i == '1': #Пользователь хочет что-то добавить, соберём у него эти данные, чтобы внести их в адресную книгу
        fio1 = input('Введите ФИО: ')
        adres1 = input('Введите адрес: ')
        phone1 = input('Введите номер телефона: ')
        bd1 = input('Введите дату рождения: ')
        df.loc[len(df)] = [fio1, adres1, phone1, bd1]  #Добавляем введённые данные как последнюю строку, потому что len(df)-кол-во строк, а индексация начинается с 0, поэтому указывая len(df) мы добавим как последнюю строку
        print(df)
        print('-----------------------------------------------------------------------')
    elif i == '2': #Пользователь хочет удалить строку, спросим у него номер
        n = int(input('Введите индекс строки, которую хотите удалить: '))
        if 0 <= n <= len(df)-1: #Проверяем, чтобы пользователь не ввёл индекс строки, которой нету в адресной книжке, ограничение до len(df)-1 потому что len(df) посчитает количество строк (от 1 до n), а индексация начинается с 0
            df = df.drop([n]) #Удаляем строку, номер которой ввёл пользователь
            df = df.reset_index(drop=True) #Удалили старый (удалённый) индекс при помощи drop=True
            print(df)
            print('-----------------------------------------------------------------------')
        else:
            print('Неверный индекс строки!')
    elif i == '3': #Изменение строки
        n1 = int(input('Введите индекс строки, которую хотите изменить: '))
        if 0 <= n1 <= len(df)-1: #Аналогично так же как и при удалении строки
            fio2 = input('Введите ФИО: ')
            adres2 = input('Введите адрес: ')
            phone2 = input('Введите номер телефона: ')
            bd2 = input('Введите дату рождения: ')
            df.loc[n1] = [fio2, adres2, phone2, bd2] #Изменяем строку под номером n1 (которую хочет изменить пользователь)
            print(df)
        else:
            print('Неверный индекс строки!') #Если пользователь вводит некорректное n1
        print('-----------------------------------------------------------------------')
    elif i == '4': #Пользователь закончил редактировать адресную книжку, выведем её итоговую версию
        print('Итоговая адресная книжка:')
        print(df)
        print('-----------------------------------------------------------------------')

    else:
        print('Некорректный ввод(должно быть от 1 до 4), попробуйте ещё раз: ')
