import numpy as np

N = int(input('Введите число строк матрицы: ')) #Исходные данные для создания матрицы
M = int(input('Введите число столбцов матрицы: '))
if N>0 and M>0: #Проверяем чтобы пользователь ввёл корректный размер матрицы
    m = np.random.random((N, M)) #Функция создаёт массив произвольной формы (в нашем случае NxM), заполненный элементами от 0 до 1

    print(f'Матрица с заданным размером {N}x{M}')
    print(m) #Выводим матрицу
    print('----------------------------------')
    print('Транспонированная матрица:')
    mt= np.transpose(m) #Транспонируем матрицу
    print(mt)
    print('----------------------------------')
    if N == M: #Введём проверку на квадратную матрицу, т.к только у квадратных вычисляется определитель
        det = np.linalg.det(m) #Вычисляем определитель исходной матрицы
        print(f'Определитель исходной матрицы: {det}')
        detT = np.linalg.det(mt) #Вычисляем определитель транспонированной матрицы
        print(f'Определитель транспонированной матрицы: {detT}')
        det=round(det, 5) #Чтобы не происходило неточностей (из-за того, что вычисляем определитель в float) округлим определители двух матриц (оставим 5 знаков после запятой, чего достаточно)
        detT=round(detT, 5)
        if det > detT: #Сравниваем определители двух матриц, выводим соответствующий результат сравнения (но при этом, они всегда должны быть равны (математически так заложено))
            print(f'Сравнение определителей исходной и транспонированной матриц: {det} > {detT}')
        elif det == detT:
            print(f'Сравнение определителей исходной и транспонированной матриц: {det} = {detT}')
        else:
            print(f'Сравнение определителей исходной и транспонированной матриц: {det} < {detT}')
    else:
        print('Определитель можно вычислить только для квадратных матриц') #Если пользователь ввёл не квадратную матрицу
else: 
    print('Введён некорректный размер матрицы')